tutorials/multiphase/icoReactingMultiPhaseInterFoam/inertMultiphaseMultiComponent/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev.develop                           |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    massTransferMultiphaseSystem;

phases  (gas mercury oil liquid);

mercury
{
    type            pureMovingPhaseModel;
}

oil
{
    type            pureMovingPhaseModel;
}

liquid
{
    type            multiComponentMovingPhaseModel;
}

gas
{
    type            multiComponentMovingPhaseModel;
}


surfaceTension
(
    (gas and liquid)
    {
        type            constant;
        sigma           0.005;
    }

    (gas and mercury)
    {
        type            constant;
        sigma           0.005;
    }

    (mercury and gas)
    {
        type            constant;
        sigma           0.005;
    }

    (mercury and oil)
    {
        type            constant;
        sigma           0.005;
    }

    (mercury and liquid)
    {
        type            constant;
        sigma           0.005;
    }

    (gas and oil)
    {
        type            constant;
        sigma           0.005;
    }
    (oil and liquid)
    {
        type            constant;
        sigma           0.005;
    }
);

massTransferModel
(
);
// ************************************************************************* //
